In [59]:
import sys
import os
sys.path.append(os.path.abspath(".."))

# Start by importing necessary packages
import pandas as pd

from dstapi.dstapi import DstApi

In [60]:
# Initialize the class with the target table
data_table = DstApi('RECIDIV9')

# Get the table summary
data_table.tablesummary(language='da')

Table RECIDIV9: Personer efter køn, alder, uddannelse, recidiv hændelser og tid
Last update: 2024-11-07T08:00:00

,variable name,# values,First value,First value label,Last value,Last value label,Time variable
0,KØN,3,TOT,I alt,K,Kvinder,False
1,ALDER1,9,00,I alt,6099,60 år og derover,False
2,UDDANNELSE,6,TOT,I alt,00,Uoplyst uddannelse,False
3,RECHEN,7,00,I alt,111,10 eller flere tilbagefald,False
4,Tid,13,2008:2010,2008:2010,2020:2022,2020:2022,True

In [ ]:
# Start by constructing a basic dictionary
params = data_table.define_base_params(language='da')
params['format'] = 'csv'

params

{'table': 'recidiv9',
 'format': 'csv',
 'lang': 'da',
 'variables': [{'code': 'KØN', 'values': ['*']},
  {'code': 'ALDER1', 'values': ['*']},
  {'code': 'UDDANNELSE', 'values': ['*']},
  {'code': 'RECHEN', 'values': ['*']},
  {'code': 'Tid', 'values': ['*']}]}

In [62]:
# Go through all values and extract all their possible values
for var in params['variables']:
  # Extract all possible values for this column
  levels = data_table.variable_levels(var['code'], language='da')

  # Exclude the "I alt" data entry
  levels = levels[levels['text'] != 'I alt']

  # Override the existing values with the extracted filtered values
  var['values'] = levels['id'].tolist()

In [63]:
params

{'table': 'recidiv9',
 'format': 'csv',
 'lang': 'da',
 'variables': [{'code': 'KØN', 'values': ['M', 'K']},
  {'code': 'ALDER1',
   'values': ['1519', '2024', '2529', '3034', '3539', '4049', '5059', '6099']},
  {'code': 'UDDANNELSE', 'values': ['10', '20', '35', '40', '00']},
  {'code': 'RECHEN', 'values': ['106', '107', '108', '109', '110', '111']},
  {'code': 'Tid',
   'values': ['2008:2010',
    '2009:2011',
    '2010:2012',
    '2011:2013',
    '2012:2014',
    '2013:2015',
    '2014:2016',
    '2015:2017',
    '2016:2018',
    '2017:2019',
    '2018:2020',
    '2019:2021',
    '2020:2022']}]}

In [64]:
# Fetch all the data from the table with the specified params
df = data_table.get_data(params=params)

In [65]:
df.shape

(6240, 6)

In [66]:
df.head()

    KØN    ALDER1  UDDANNELSE             RECHEN        TID  INDHOLD
0  Mænd  15-19 år  Grundskole  Ingen tilbagefald  2008:2010     3502
1  Mænd  15-19 år  Grundskole  Ingen tilbagefald  2009:2011     3727
2  Mænd  15-19 år  Grundskole  Ingen tilbagefald  2010:2012     3137
3  Mænd  15-19 år  Grundskole  Ingen tilbagefald  2011:2013     3147
4  Mænd  15-19 år  Grundskole  Ingen tilbagefald  2012:2014     3000